DELETE
FROM MEAL;
DELETE
FROM USERS;
DELETE
FROM RESTAURANTS;

ALTER SEQUENCE global_seq RESTART WITH 100000;




INSERT INTO users (name, email, password)
VALUES ('Admin', 'user@yandex.ru', 'password'),
       ('Admin1', 'admin@gmail.com', 'admin'),
       ('Admin2', 'guest@gmail.com', 'guest');

INSERT INTO RESTAURANTS (USER_ID, NAME)
VALUES (100000, 'Ресторан Русской кухни'),
       (100000, 'Хинкальная №1'),
       (100001, 'KFC'),
       (100001, 'Вкусно и точка'),
       (100002, 'Панорама'),
       (100002, 'Пельменная');




INSERT INTO meal (RESTAURANT_ID, DATE, NAME, PRICE)
VALUES (100003, '2023-03-05', 'черный чай с сахаром', 10.5),
       (100003, '2023-03-05', 'суп гороховый', 70.0),
       (100003, '2023-03-05', 'гречневая каша', 30.3),
       (100003, '2023-03-05', 'салат мимоза', 30.3),
       (100004, '2023-03-05', 'чай с травами', 60.5),
       (100004, '2023-03-05', 'хинкали с бараниной', 300.8),
       (100004, '2023-03-05', 'соус сацебели', 50.5),
       (100004, '2023-03-05', 'соус хачапури', 100.0),
       (100005, '2023-03-05', 'капучино', 100.25),
       (100005, '2023-03-05', 'торт', 78.55),
       (100005, '2023-03-05', 'острые крылья', 170.5),
       (100005, '2023-03-05', 'картофель фри', 120.0),
       (100006, '2023-03-05', 'апельсиновый сок', 70.0),
       (100006, '2023-03-05', 'гамбургер с сыром', 130.0),
       (100006, '2023-03-05', 'картофель по деревенски', 120.0),
       (100006, '2023-03-05', 'сырный соус', 88.0),
       (100007, '2023-03-05', 'виски', 100.0),
       (100007, '2023-03-05', 'стек рибай', 1000.0),
       (100007, '2023-03-05', 'перечный соус', 250.0),
       (100007, '2023-03-05', 'овощи гриль', 450.0),
       (100008, '2023-03-05', 'компот из сухофруктов', 50.0),
       (100008, '2023-03-05', 'пельмени из говядины и свинины', 350.0),
       (100008, '2023-03-05', 'соус томатный', 20.0);
